; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	image5 - mode
	image9 - mode
	thermograph1 - mode
	thermograph0 - mode
	image4 - mode
	spectrograph3 - mode
	infrared7 - mode
	spectrograph8 - mode
	infrared6 - mode
	image2 - mode
	GroundStation0 - direction
	Star1 - direction
	GroundStation2 - direction
	Star4 - direction
	Star5 - direction
	Star3 - direction
	Planet6 - direction
	Phenomenon7 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Phenomenon10 - direction
	Phenomenon11 - direction
)
(:init
	(supports instrument0 thermograph1)
	(supports instrument0 image4)
	(supports instrument0 spectrograph8)
	(supports instrument0 image2)
	(supports instrument0 infrared6)
	(supports instrument0 infrared7)
	(supports instrument0 spectrograph3)
	(supports instrument0 thermograph0)
	(supports instrument0 image9)
	(supports instrument0 image5)
	(calibration_target instrument0 Star3)
	(calibration_target instrument0 Star5)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star4)
)
(:goal (and
	(have_image Planet6 spectrograph8)
	(have_image Planet6 spectrograph3)
	(have_image Phenomenon7 image5)
	(have_image Phenomenon7 thermograph0)
	(have_image Phenomenon7 infrared6)
	(have_image Planet8 thermograph1)
	(have_image Planet8 image2)
	(have_image Planet8 spectrograph3)
	(have_image Phenomenon9 thermograph0)
	(have_image Phenomenon10 image4)
	(have_image Phenomenon11 image9)
	(have_image Phenomenon11 spectrograph8)
	(have_image Phenomenon11 infrared7)
))

)

; plan
1. (turn_to satellite0 star3 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 star3)
   goals met: 0 of 13
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 13
3. (calibrate satellite0 instrument0 star3)
   added: (calibrated instrument0)
   goals met: 0 of 13
4. (turn_to satellite0 planet6 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 planet6)
   goals met: 0 of 13
5. (take_image satellite0 planet6 instrument0 spectrograph8)
   added: (have_image planet6 spectrograph8)
   goals met: 1 of 13
6. (take_image satellite0 planet6 instrument0 spectrograph3)
   added: (have_image planet6 spectrograph3)
   goals met: 2 of 13
7. (turn_to satellite0 phenomenon9 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 phenomenon9)
   goals met: 2 of 13
8. (take_image satellite0 phenomenon9 instrument0 thermograph0)
   added: (have_image phenomenon9 thermograph0)
   goals met: 3 of 13
9. (turn_to satellite0 phenomenon11 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 phenomenon11)
   goals met: 3 of 13
10. (take_image satellite0 phenomenon11 instrument0 spectrograph8)
   added: (have_image phenomenon11 spectrograph8)
   goals met: 4 of 13
11. (take_image satellite0 phenomenon11 instrument0 infrared7)
   added: (have_image phenomenon11 infrared7)
   goals met: 5 of 13
12. (take_image satellite0 phenomenon11 instrument0 image9)
   added: (have_image phenomenon11 image9)
   goals met: 6 of 13
13. (turn_to satellite0 phenomenon10 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 phenomenon10)
   goals met: 6 of 13
14. (take_image satellite0 phenomenon10 instrument0 image4)
   added: (have_image phenomenon10 image4)
   goals met: 7 of 13
15. (turn_to satellite0 phenomenon7 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 phenomenon7)
   goals met: 7 of 13
16. (take_image satellite0 phenomenon7 instrument0 image5)
   added: (have_image phenomenon7 image5)
   goals met: 8 of 13
17. (take_image satellite0 phenomenon7 instrument0 infrared6)
   added: (have_image phenomenon7 infrared6)
   goals met: 9 of 13
18. (take_image satellite0 phenomenon7 instrument0 thermograph0)
   added: (have_image phenomenon7 thermograph0)
   goals met: 10 of 13
19. (turn_to satellite0 planet8 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 planet8)
   goals met: 10 of 13
20. (take_image satellite0 planet8 instrument0 image2)
   added: (have_image planet8 image2)
   goals met: 11 of 13
21. (take_image satellite0 planet8 instrument0 spectrograph3)
   added: (have_image planet8 spectrograph3)
   goals met: 12 of 13
22. (take_image satellite0 planet8 instrument0 thermograph1)
   added: (have_image planet8 thermograph1)
   goals met: 13 of 13
